madmentat/mad-esp32p4_ass-pain_edition/main/stm32_swd_programmer.c
/*
 * stm32_swd_programmer.c
 *
 * ESP32-P4 -> STM32F030 software SWD master.
 *
 * fix25_stm32_swd_ack5_no_extra_turnaround:
 *   - keeps CMSIS-style SWD transfers;
 *   - uses short MEM-AP programming chunks instead of long 1 KiB streams;
 *   - restores PG/program session after SWD desync and retries the current halfword;
 *   - avoids FLASH_SR polling during the tight halfword program loop;
 *   - clears debug halt/vector-catch and requests a CMSIS-style SYSRESETREQ
 *     before the final NRST pulse so the STM32 really starts the new app;
 *   - handles marginal write ACK=0x05 as ACK OK with NO extra turnaround,
 *     because the sampled third ACK bit is very likely already the release/turnaround
 *     cycle on this bit-banged P4 wiring;
 *   - uses a release-reset-then-immediate-DAP fallback instead of trying to
 *     fully initialise DAP while NRST is held low.
 *
 * Current JC4880P443C bench pin assignment:
 *   NRST  -> GPIO29
 *   SWDIO -> GPIO33
 *   SWCLK -> GPIO31
 */

#include "stm32_swd_programmer.h"

#include <inttypes.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "esp_check.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_rom_sys.h"
#include "esp_timer.h"
#include "driver/gpio.h"
#include "sdkconfig.h"

#ifndef CONFIG_STM32_SWD_ENABLE
#define CONFIG_STM32_SWD_ENABLE 1
#endif

#ifndef CONFIG_STM32_SWD_NRST_GPIO
#define CONFIG_STM32_SWD_NRST_GPIO 29
#endif

#ifndef CONFIG_STM32_SWD_SWDIO_GPIO
#define CONFIG_STM32_SWD_SWDIO_GPIO 33
#endif

#ifndef CONFIG_STM32_SWD_SWCLK_GPIO
#define CONFIG_STM32_SWD_SWCLK_GPIO 31
#endif

#ifndef CONFIG_STM32_SWD_BIT_DELAY_US
#define CONFIG_STM32_SWD_BIT_DELAY_US 2
#endif

#ifndef CONFIG_STM32_SWD_TASK_STACK_SIZE
#define CONFIG_STM32_SWD_TASK_STACK_SIZE 4096
#endif

#ifndef CONFIG_STM32_SWD_TASK_PRIORITY
#define CONFIG_STM32_SWD_TASK_PRIORITY 3
#endif

#ifndef CONFIG_STM32_SWD_TASK_CORE
#define CONFIG_STM32_SWD_TASK_CORE 0
#endif

#ifndef CONFIG_STM32_SWD_SCOPE_TEST_ENABLE
#define CONFIG_STM32_SWD_SCOPE_TEST_ENABLE 0
#endif

#ifndef CONFIG_STM32_SWD_SCOPE_TEST_PERIOD_MS
#define CONFIG_STM32_SWD_SCOPE_TEST_PERIOD_MS 100
#endif

#define SWD_PIN_NRST      ((gpio_num_t)CONFIG_STM32_SWD_NRST_GPIO)
#define SWD_PIN_SWDIO     ((gpio_num_t)CONFIG_STM32_SWD_SWDIO_GPIO)
#define SWD_PIN_SWCLK     ((gpio_num_t)CONFIG_STM32_SWD_SWCLK_GPIO)
#define SWD_DELAY_US_CFG      CONFIG_STM32_SWD_BIT_DELAY_US
#define SWD_DELAY_US_DEFAULT  ((SWD_DELAY_US_CFG < 2) ? 2 : SWD_DELAY_US_CFG)
#define SWD_DELAY_US_SLOW     10U

static uint32_t s_swd_delay_us = SWD_DELAY_US_DEFAULT;

/* CMSIS-DAP-style SWD request bits: APnDP, RnW, A2, A3. */
#define SWD_REQ_APnDP     (1U << 0)
#define SWD_REQ_RnW       (1U << 1)
#define SWD_REQ_A2        (1U << 2)
#define SWD_REQ_A3        (1U << 3)

#define SWD_ACK_OK        0x1U
#define SWD_ACK_WAIT      0x2U
#define SWD_ACK_FAULT     0x4U

#define SWD_TURNAROUND_CYCLES 1U
#define SWD_IDLE_CYCLES       8U
#define SWD_RETRY_COUNT       8

#define DP_ADDR_IDCODE    0x00U  /* DP read  addr 0x0 */
#define DP_ADDR_ABORT     0x00U  /* DP write addr 0x0 */
#define DP_ADDR_CTRL_STAT 0x04U
#define DP_ADDR_SELECT    0x08U
#define DP_ADDR_RDBUFF    0x0CU

#define AP_ADDR_CSW       0x00U
#define AP_ADDR_TAR       0x04U
#define AP_ADDR_DRW       0x0CU
#define AP_ADDR_IDR       0x0CU  /* AP bank 0xF, addr 0xFC */

#define DP_ABORT_ALL      0x0000001EU
#define DP_CTRL_PWRUP_REQ 0x50000000U
#define DP_CTRL_PWRUP_ACK 0xA0000000U

/* Cortex-M AHB-AP CSW: 32-bit access, auto-increment single, common defaults. */
#define AHB_AP_CSW_BASE   0x23000050U
#define AHB_AP_CSW_8BIT   (AHB_AP_CSW_BASE | 0U)
#define AHB_AP_CSW_16BIT  (AHB_AP_CSW_BASE | 1U)
#define AHB_AP_CSW_32BIT  (AHB_AP_CSW_BASE | 2U)

#define ARM_CPUID_ADDR             0xE000ED00U
#define STM32F0_DBGMCU_IDCODE_ADDR 0x40015800U

#define ARM_DHCSR_ADDR             0xE000EDF0U
#define ARM_DHCSR_DBGKEY           0xA05F0000U
#define ARM_DHCSR_C_DEBUGEN        (1U << 0)
#define ARM_DHCSR_C_HALT           (1U << 1)
#define ARM_DHCSR_S_HALT           (1U << 17)
#define ARM_DEMCR_ADDR             0xE000EDFCU
#define ARM_DEMCR_VC_CORERESET     (1U << 0)
#define ARM_AIRCR_ADDR             0xE000ED0CU
#define ARM_AIRCR_VECTKEY          (0x5FAU << 16)
#define ARM_AIRCR_SYSRESETREQ      (1U << 2)

#define STM32F0_FLASH_BASE_ADDR    0x08000000U
#define STM32F0_FLASH_PAGE_SIZE    1024U
#define STM32F0_FLASH_MAX_BYTES    (32U * 1024U)

#define STM32F0_FLASH_REG_BASE     0x40022000U
#define STM32F0_FLASH_KEYR         (STM32F0_FLASH_REG_BASE + 0x04U)
#define STM32F0_FLASH_SR           (STM32F0_FLASH_REG_BASE + 0x0CU)
#define STM32F0_FLASH_CR           (STM32F0_FLASH_REG_BASE + 0x10U)
#define STM32F0_FLASH_AR           (STM32F0_FLASH_REG_BASE + 0x14U)

#define STM32F0_FLASH_KEY1         0x45670123U
#define STM32F0_FLASH_KEY2         0xCDEF89ABU
#define STM32F0_FLASH_SR_BSY       (1U << 0)
#define STM32F0_FLASH_SR_PGERR     (1U << 2)
#define STM32F0_FLASH_SR_WRPRTERR  (1U << 4)
#define STM32F0_FLASH_SR_EOP       (1U << 5)
#define STM32F0_FLASH_SR_ERRS      (STM32F0_FLASH_SR_PGERR | STM32F0_FLASH_SR_WRPRTERR)
#define STM32F0_FLASH_CR_PG        (1U << 0)
#define STM32F0_FLASH_CR_PER       (1U << 1)
#define STM32F0_FLASH_CR_STRT      (1U << 6)
#define STM32F0_FLASH_CR_LOCK      (1U << 7)

#define STM32F0_PROG_BLIND_DELAY_US  450U
#define STM32F0_PROG_YIELD_EVERY_HW  16U
#define STM32F0_PROG_SR_CHECK_BYTES  0U
/* Long auto-increment streams were fast, but on the real P4->STM32 wiring they
 * sometimes lost SWD framing in the middle of an image. 64 bytes still avoids
 * setting TAR for every halfword, but regularly re-anchors MEM-AP to the exact
 * flash address and makes recovery deterministic. */
#define STM32F0_PROG_STREAM_CHUNK_BYTES 64U
#define STM32F0_PROG_RETRY_COUNT 10

static const char *TAG = "STM32_SWD";
static TaskHandle_t s_probe_task;
static SemaphoreHandle_t s_swd_lock;

static stm32_swd_state_t s_state = {
    .status = STM32_SWD_STATUS_IDLE,
    .last_result = ESP_OK,
    .dp_idcode = 0,
    .cpuid = 0,
    .dbgmcu_idcode = 0,
    .last_message = "idle",
};

static portMUX_TYPE s_state_mux = portMUX_INITIALIZER_UNLOCKED;

static void state_set(stm32_swd_status_t status, esp_err_t result, const char *message)
{
    portENTER_CRITICAL(&s_state_mux);
    s_state.status = status;
    s_state.last_result = result;
    if (message) {
        snprintf(s_state.last_message, sizeof(s_state.last_message), "%s", message);
    }
    portEXIT_CRITICAL(&s_state_mux);
}

static void state_set_values(uint32_t dp_idcode, uint32_t cpuid, uint32_t dbgmcu_idcode)
{
    portENTER_CRITICAL(&s_state_mux);
    s_state.dp_idcode = dp_idcode;
    s_state.cpuid = cpuid;
    s_state.dbgmcu_idcode = dbgmcu_idcode;
    portEXIT_CRITICAL(&s_state_mux);
}

static inline void swd_delay(void)
{
    if (s_swd_delay_us > 0U) {
        esp_rom_delay_us(s_swd_delay_us);
    }
}

/* --------------------------------------------------------------------------
 * Low-level GPIO primitives.
 *
 * The write/read/clock functions below intentionally match CMSIS-DAP SW_DP.c:
 *   SW_CLOCK_CYCLE: SWCLK low -> delay -> SWCLK high -> delay
 *   SW_WRITE_BIT:   set SWDIO -> SWCLK low -> delay -> SWCLK high -> delay
 *   SW_READ_BIT:    SWCLK low -> delay -> sample SWDIO -> SWCLK high -> delay
 *
 * This means each helper leaves SWCLK high, just like CMSIS-DAP. The next bit
 * starts by taking SWCLK low again. Do not "fix" this back to the old high-low
 * style unless the entire transfer timing is reworked.
 * -------------------------------------------------------------------------- */

static inline void swclk_low(void)
{
    gpio_set_level(SWD_PIN_SWCLK, 0);
}

static inline void swclk_high(void)
{
    gpio_set_level(SWD_PIN_SWCLK, 1);
}

static inline void swd_clock_cycle(void)
{
    swclk_low();
    swd_delay();
    swclk_high();
    swd_delay();
}

