madmentat/mad-esp32p4_ass-pain_edition/main/stm32_swd_programmer.c
static inline void swdio_drive(unsigned bit)
{
    gpio_set_level(SWD_PIN_SWDIO, bit ? 1 : 0);
}

static void swdio_output_enable(void)
{
    gpio_set_pull_mode(SWD_PIN_SWDIO, GPIO_PULLUP_ONLY);
    gpio_set_direction(SWD_PIN_SWDIO, GPIO_MODE_OUTPUT);
}

static void swdio_output_disable(void)
{
    /* Release the bidirectional wire. The internal pull-up is only a helper;
     * when the target drives ACK/data it easily overrides it. */
    gpio_set_level(SWD_PIN_SWDIO, 1);
    gpio_set_direction(SWD_PIN_SWDIO, GPIO_MODE_INPUT);
    gpio_set_pull_mode(SWD_PIN_SWDIO, GPIO_PULLUP_ONLY);
}

static void swdio_output_high(void)
{
    swdio_drive(1);
    swdio_output_enable();
    swdio_drive(1);
}

static inline void swd_write_bit(unsigned bit)
{
    swdio_drive(bit & 1U);
    swclk_low();
    swd_delay();
    swclk_high();
    swd_delay();
}

static inline unsigned swd_read_bit(void)
{
    swclk_low();
    swd_delay();
    unsigned bit = (unsigned)gpio_get_level(SWD_PIN_SWDIO) & 1U;
    swclk_high();
    swd_delay();
    return bit;
}

static void nrst_assert(void)
{
    /* NRST as open-drain style: actively pull low only. */
    gpio_set_direction(SWD_PIN_NRST, GPIO_MODE_OUTPUT);
    gpio_set_level(SWD_PIN_NRST, 0);
}

static void nrst_release(void)
{
    /* Release reset instead of driving it high. Most target boards already have
     * NRST pull-up; ESP32-P4 internal pull-up is enabled as bench insurance. */
    gpio_set_level(SWD_PIN_NRST, 1);
    gpio_set_direction(SWD_PIN_NRST, GPIO_MODE_INPUT);
    gpio_set_pull_mode(SWD_PIN_NRST, GPIO_PULLUP_ONLY);
}

static void swd_bus_prepare(void)
{
    /* Reclaim SWD pins before every transaction. The final reset path releases
     * SWDIO/SWCLK so the target application can run without the ESP32 driving
     * PA13/PA14 forever. */
    gpio_set_direction(SWD_PIN_SWCLK, GPIO_MODE_OUTPUT);
    gpio_set_level(SWD_PIN_SWCLK, 1);
    gpio_set_pull_mode(SWD_PIN_SWDIO, GPIO_PULLUP_ONLY);
    swdio_output_high();
    nrst_release();
}

static void swd_bus_release_idle(void)
{
    swdio_output_disable();
    gpio_set_level(SWD_PIN_SWCLK, 1);
    gpio_set_direction(SWD_PIN_SWCLK, GPIO_MODE_INPUT);
    gpio_set_pull_mode(SWD_PIN_SWCLK, GPIO_PULLUP_ONLY);
    nrst_release();
}

static unsigned parity32(uint32_t value)
{
    value ^= value >> 16;
    value ^= value >> 8;
    value ^= value >> 4;
    value &= 0xFU;
    return (0x6996U >> value) & 1U;
}

static esp_err_t swd_ack_to_err(uint32_t ack)
{
    switch (ack) {
    case SWD_ACK_WAIT:
        return ESP_ERR_TIMEOUT;
    case SWD_ACK_FAULT:
        return ESP_FAIL;
    default:
        return ESP_FAIL;
    }
}

static const char *swd_ack_name(uint32_t ack)
{
    switch (ack) {
    case SWD_ACK_OK: return "OK";
    case SWD_ACK_WAIT: return "WAIT";
    case SWD_ACK_FAULT: return "FAULT";
    default: return "PROTO";
    }
}

static void swd_write_bits_lsb(uint32_t value, unsigned count)
{
    for (unsigned i = 0; i < count; ++i) {
        swd_write_bit((value >> i) & 1U);
    }
}

static void swd_line_reset(void)
{
    swdio_output_high();
    /* At least 50 clocks with SWDIO high. Use 64. */
    swd_write_bits_lsb(0xFFFFFFFFU, 32);
    swd_write_bits_lsb(0xFFFFFFFFU, 32);
}

static void swd_idle_cycles(unsigned count)
{
    swdio_output_enable();
    swdio_drive(0);
    for (unsigned i = 0; i < count; ++i) {
        swd_clock_cycle();
    }
    swdio_drive(1);
}

static void swd_swj_sequence_16(uint16_t sequence_lsb_first)
{
    swdio_output_high();
    swd_write_bits_lsb(sequence_lsb_first, 16);
}

static void swd_enter_swd_from_jtag(void)
{
    ESP_LOGI(TAG, "CMSIS-style SWJ enter SWD: line_reset -> 0xE79E LSB-first -> line_reset -> idle");
    swclk_high();
    swd_line_reset();
    swd_swj_sequence_16(0xE79EU);
    swd_line_reset();
    swd_idle_cycles(SWD_IDLE_CYCLES);
}

static void swd_reconnect_swd_only(void)
{
    ESP_LOGI(TAG, "CMSIS-style SWD reconnect: line_reset only -> idle");
    swclk_high();
    swd_line_reset();
    swd_idle_cycles(SWD_IDLE_CYCLES);
}

static void swd_protocol_recover(void)
{
    /* Keep the selected SW-DP, but resynchronize the serial engine after
     * parity/protocol errors. ADIv5 recommends at least 50 clocks with the
     * line high/tristated before retrying READID/a new operation. */
    swclk_high();
    swd_line_reset();
    swd_idle_cycles(SWD_IDLE_CYCLES);
}

static void swd_scope_pin_test(void)
{
#if CONFIG_STM32_SWD_SCOPE_TEST_ENABLE
    const TickType_t d = pdMS_TO_TICKS(CONFIG_STM32_SWD_SCOPE_TEST_PERIOD_MS);

    ESP_LOGW(TAG,
             "SWD scope pin test start: NRST=%d SWDIO=%d SWCLK=%d period=%dms; only real SWD pins are toggled",
             (int)SWD_PIN_NRST,
             (int)SWD_PIN_SWDIO,
             (int)SWD_PIN_SWCLK,
             CONFIG_STM32_SWD_SCOPE_TEST_PERIOD_MS);

    gpio_set_direction(SWD_PIN_SWCLK, GPIO_MODE_OUTPUT);
    gpio_set_direction(SWD_PIN_SWDIO, GPIO_MODE_OUTPUT);
    gpio_set_level(SWD_PIN_SWCLK, 0);
    gpio_set_level(SWD_PIN_SWDIO, 0);
    vTaskDelay(d);

    ESP_LOGW(TAG, "SWD scope pin test: toggling SWCLK GPIO%d", (int)SWD_PIN_SWCLK);
    for (int i = 0; i < 12; ++i) {
        gpio_set_level(SWD_PIN_SWCLK, i & 1);
        gpio_set_level(SWD_PIN_SWDIO, 0);
        ESP_LOGI(TAG, "PINTEST SWCLK_GPIO%d=%d", (int)SWD_PIN_SWCLK, gpio_get_level(SWD_PIN_SWCLK));
        vTaskDelay(d);
    }

    gpio_set_level(SWD_PIN_SWCLK, 0);
    ESP_LOGW(TAG, "SWD scope pin test: toggling SWDIO GPIO%d", (int)SWD_PIN_SWDIO);
    for (int i = 0; i < 12; ++i) {
        gpio_set_level(SWD_PIN_SWDIO, i & 1);
        ESP_LOGI(TAG, "PINTEST SWDIO_GPIO%d=%d", (int)SWD_PIN_SWDIO, gpio_get_level(SWD_PIN_SWDIO));
        vTaskDelay(d);
    }

    gpio_set_level(SWD_PIN_SWCLK, 0);
    gpio_set_level(SWD_PIN_SWDIO, 1);
    ESP_LOGW(TAG, "SWD scope pin test done; starting real SWD transaction on SWDIO GPIO%d", (int)SWD_PIN_SWDIO);
    vTaskDelay(pdMS_TO_TICKS(20));
#endif
}

static uint32_t swd_make_request(bool ap, bool read, uint8_t addr)
{
    uint32_t req = 0;
    if (ap) {
        req |= SWD_REQ_APnDP;
    }
    if (read) {
        req |= SWD_REQ_RnW;
    }
    req |= ((uint32_t)(addr >> 2) & 0x3U) << 2;
    return req;
}

