madmentat/mad-esp32p4_ass-pain_edition/main/stm32_swd_programmer.c
/* CMSIS-DAP-style SWD_Transfer().
 * request bits are APnDP/RnW/A2/A3 in bits [3:0]. data points to WDATA/RDATA.
 * return is ACK[2:0] in canonical LSB-first numeric form: OK=1, WAIT=2, FAULT=4.
 */
static uint8_t cmsis_swd_transfer(uint32_t request, uint32_t *data)
{
    uint32_t ack = 0;
    uint32_t bit = 0;
    uint32_t val = 0;
    uint32_t parity = 0;
    bool write_ack5_no_extra_turnaround = false;

    /* Packet request. */
    swdio_output_enable();

    swd_write_bit(1U);                          /* Start */

    bit = (request >> 0) & 1U;
    swd_write_bit(bit);                         /* APnDP */
    parity += bit;

    bit = (request >> 1) & 1U;
    swd_write_bit(bit);                         /* RnW */
    parity += bit;

    bit = (request >> 2) & 1U;
    swd_write_bit(bit);                         /* A2 */
    parity += bit;

    bit = (request >> 3) & 1U;
    swd_write_bit(bit);                         /* A3 */
    parity += bit;

    swd_write_bit(parity & 1U);                 /* Parity */
    swd_write_bit(0U);                          /* Stop */
    swd_write_bit(1U);                          /* Park */

    /* Turnaround: host releases SWDIO, target owns it. */
    swdio_output_disable();
    for (uint32_t n = SWD_TURNAROUND_CYCLES; n; --n) {
        swd_clock_cycle();
    }

    /* ACK response: bit0, bit1, bit2. */
    bit = swd_read_bit();
    ack = bit << 0;
    bit = swd_read_bit();
    ack |= bit << 1;
    bit = swd_read_bit();
    ack |= bit << 2;

    if (ack == 0x05U && ((request & SWD_REQ_RnW) == 0U)) {
        /* Bench symptom from OTA logs:
         *   DP IDCODE can be read, then DP/AP writes often return raw ACK=0x05.
         * 0x05 is not a legal SWD ACK. The useful interpretation for this
         * bit-banged P4->STM32 wiring is:
         *   - bit0=1 and bit1=0 are the real ACK OK bits;
         *   - bit2=1 is not a real ACK bit, but the already released/turnaround
         *     line sampled high through pull-up.
         *
         * In fix24 we treated ACK=0x05 as OK but still inserted the normal
         * target-to-host -> host-to-target turnaround clock before WDATA. That
         * puts WDATA one clock late in the early-release case. The next read
         * then sees a shifted word/parity error and the link collapses into
         * ACK=0x07. For ACK=0x05 writes, consume no additional turnaround cycle:
         * take SWDIO immediately and start WDATA on the next clock. */
        ESP_LOGW(TAG,
                 "CMSIS SWD write req=0x%lx raw ACK=0x05 treated as OK with no extra turnaround",
                 (unsigned long)request);
        write_ack5_no_extra_turnaround = true;
    }

    if (ack == SWD_ACK_OK || write_ack5_no_extra_turnaround) {
        if (request & SWD_REQ_RnW) {
            /* Target-to-host data phase. */
            val = 0;
            parity = 0;
            for (uint32_t n = 32; n; --n) {
                bit = swd_read_bit();
                parity += bit;
                val >>= 1;
                val |= bit << 31;
            }

            bit = swd_read_bit();               /* Read parity */
            if (((parity ^ bit) & 1U) != 0U) {
                ESP_LOGW(TAG,
                         "CMSIS SWD parity error req=0x%lx val=0x%08" PRIx32 " parity_sum=%lu parity_bit=%lu",
                         (unsigned long)request,
                         val,
                         (unsigned long)(parity & 1U),
                         (unsigned long)bit);
                ack = 0U;                       /* Protocol-style error for caller. */
            }
            if (data) {
                *data = val;
            }

            /* Turnaround: target releases, host takes line back. */
            for (uint32_t n = SWD_TURNAROUND_CYCLES; n; --n) {
                swd_clock_cycle();
            }
            swdio_output_enable();
        } else {
            /* Turnaround: target releases ACK, host takes line before WDATA.
             * If raw ACK=0x05 was accepted above, the high third "ACK" bit is
             * assumed to be that release/turnaround cycle already. Do not add
             * one more clock or WDATA becomes shifted by one bit. */
            if (!write_ack5_no_extra_turnaround) {
                for (uint32_t n = SWD_TURNAROUND_CYCLES; n; --n) {
                    swd_clock_cycle();
                }
            }
            swdio_output_enable();

            val = data ? *data : 0U;
            parity = 0;
            for (uint32_t n = 32; n; --n) {
                bit = val & 1U;
                swd_write_bit(bit);             /* WDATA[0:31] */
                parity += bit;
                val >>= 1;
            }
            swd_write_bit(parity & 1U);         /* Write parity */
        }

        /* SWD idle cycles. Keep line low for clocks, then return high. */
        if (SWD_IDLE_CYCLES) {
            swdio_drive(0U);
            for (uint32_t n = SWD_IDLE_CYCLES; n; --n) {
                swd_clock_cycle();
            }
        }
        swdio_drive(1U);
        return SWD_ACK_OK;
    }

    if ((ack == SWD_ACK_WAIT) || (ack == SWD_ACK_FAULT)) {
        /* WAIT/FAULT has no successful data payload in our configuration. */
        for (uint32_t n = SWD_TURNAROUND_CYCLES; n; --n) {
            swd_clock_cycle();
        }
        swdio_output_enable();
        swdio_drive(1U);
        return (uint8_t)ack;
    }

    /* Protocol error: back off enough clocks to let target release any phase. */
    for (uint32_t n = SWD_TURNAROUND_CYCLES + 32U + 1U; n; --n) {
        swd_clock_cycle();
    }
    swdio_output_enable();
    swdio_drive(1U);
    return (uint8_t)ack;
}

static esp_err_t swd_transfer_checked(bool ap, bool read, uint8_t addr, uint32_t *data)
{
    const uint32_t req = swd_make_request(ap, read, addr);
    esp_err_t last_err = ESP_FAIL;

    for (int retry = 0; retry < SWD_RETRY_COUNT; ++retry) {
        uint8_t ack = cmsis_swd_transfer(req, data);
        if (ack == SWD_ACK_OK) {
            return ESP_OK;
        }

        last_err = swd_ack_to_err(ack);

        /* WAIT is a valid SWD response: just give the target a little time. */
        if (ack == SWD_ACK_WAIT) {
            if (retry < 3 || retry == SWD_RETRY_COUNT - 1) {
                ESP_LOGW(TAG,
                         "CMSIS SWD %s %s 0x%02x ACK=0x%02x (%s) retry=%d",
                         read ? "read" : "write",
                         ap ? "AP" : "DP",
                         addr,
                         ack,
                         swd_ack_name(ack),
                         retry);
            }
            vTaskDelay(pdMS_TO_TICKS(1));
            continue;
        }

        /* FAULT is a real target-side error. Clear sticky errors and let the
         * higher layer decide what to do next. Do not blindly loop forever. */
        if (ack == SWD_ACK_FAULT) {
            ESP_LOGW(TAG,
                     "CMSIS SWD %s %s 0x%02x ACK=0x%02x (%s) retry=%d",
                     read ? "read" : "write",
                     ap ? "AP" : "DP",
                     addr,
                     ack,
                     swd_ack_name(ack),
                     retry);
            return ESP_FAIL;
        }

        /* Protocol/parity error. This is what we saw during STM32 OTA at
         * DP CTRL/STAT read: a valid-looking word followed by a bad parity bit,
         * then ACK=0x7 forever. Do not keep hammering in a desynchronized state.
         * Re-line-reset and retry the same transfer a few times. */
        ESP_LOGW(TAG,
                 "CMSIS SWD %s %s 0x%02x ACK=0x%02x (%s) retry=%d -> line reset recovery",
                 read ? "read" : "write",
                 ap ? "AP" : "DP",
                 addr,
                 ack,
                 swd_ack_name(ack),
                 retry);
        swd_protocol_recover();
        vTaskDelay(pdMS_TO_TICKS(1));
    }

    return last_err;
}

static esp_err_t dp_read(uint8_t addr, uint32_t *value)
{
    if (!value) {
        return ESP_ERR_INVALID_ARG;
    }
    return swd_transfer_checked(false, true, addr, value);
}

static esp_err_t dp_write(uint8_t addr, uint32_t value)
{
    return swd_transfer_checked(false, false, addr, &value);
}

