madmentat/mad-esp32p4_ass-pain_edition/main/stm32_swd_programmer.c
static esp_err_t ap_write(uint8_t addr, uint32_t value)
{
    return swd_transfer_checked(true, false, addr, &value);
}

static esp_err_t ap_read_posted(uint8_t addr)
{
    uint32_t ignored = 0;
    return swd_transfer_checked(true, true, addr, &ignored);
}

static esp_err_t ap_read(uint8_t addr, uint32_t *value)
{
    if (!value) {
        return ESP_ERR_INVALID_ARG;
    }
    ESP_RETURN_ON_ERROR(ap_read_posted(addr), TAG, "AP posted read request failed addr=0x%02x", addr);
    return dp_read(DP_ADDR_RDBUFF, value);
}

static esp_err_t dap_read_idcode_standard(uint32_t *dp_idcode)
{
    if (!dp_idcode) {
        return ESP_ERR_INVALID_ARG;
    }

    ESP_LOGI(TAG, "Reading DP IDCODE using CMSIS-style SWD_Transfer");
    esp_err_t ret = dp_read(DP_ADDR_IDCODE, dp_idcode);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "DP IDCODE: 0x%08" PRIx32, *dp_idcode);
    }
    return ret;
}

static esp_err_t dap_init(uint32_t *dp_idcode)
{
    if (!dp_idcode) {
        return ESP_ERR_INVALID_ARG;
    }

    *dp_idcode = 0;

    swd_enter_swd_from_jtag();
    esp_err_t ret = dap_read_idcode_standard(dp_idcode);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "DP IDCODE after SWJ switch failed: %s; trying SWD line-reset only", esp_err_to_name(ret));
        swd_reconnect_swd_only();
        ret = dap_read_idcode_standard(dp_idcode);
    }
    ESP_RETURN_ON_ERROR(ret, TAG, "DP IDCODE read failed");

    ESP_RETURN_ON_ERROR(dp_write(DP_ADDR_ABORT, DP_ABORT_ALL), TAG, "DP ABORT failed");
    ESP_RETURN_ON_ERROR(dp_write(DP_ADDR_CTRL_STAT, DP_CTRL_PWRUP_REQ), TAG, "DP CTRL/STAT power-up request failed");

    int ctrl_read_failures = 0;
    for (int i = 0; i < 50; ++i) {
        uint32_t ctrl = 0;
        ret = dp_read(DP_ADDR_CTRL_STAT, &ctrl);
        if (ret == ESP_OK) {
            ctrl_read_failures = 0;
            if ((ctrl & DP_CTRL_PWRUP_ACK) == DP_CTRL_PWRUP_ACK) {
                ESP_LOGI(TAG, "DP CTRL/STAT power-up ACK: 0x%08" PRIx32, ctrl);
                return ESP_OK;
            }
        } else {
            ++ctrl_read_failures;
            ESP_LOGW(TAG, "DP CTRL/STAT read failed during power-up poll: %s; resyncing SWD", esp_err_to_name(ret));
            swd_protocol_recover();
            if (ctrl_read_failures >= 4) {
                ESP_LOGW(TAG, "DP CTRL/STAT power-up poll lost SWD framing %d times; aborting this connect attempt", ctrl_read_failures);
                return ESP_FAIL;
            }
        }
        vTaskDelay(pdMS_TO_TICKS(2));
    }

    ESP_LOGW(TAG, "DP power-up ACK timeout");
    return ESP_ERR_TIMEOUT;
}

static esp_err_t ahb_ap_select_bank(uint32_t ap_bank)
{
    /* APSEL=0. APBANKSEL lives in SELECT[7:4]. */
    return dp_write(DP_ADDR_SELECT, (ap_bank & 0xFU) << 4);
}

static esp_err_t ahb_ap_setup(void)
{
    ESP_RETURN_ON_ERROR(ahb_ap_select_bank(0), TAG, "DP SELECT AP0 bank0 failed");
    ESP_RETURN_ON_ERROR(ap_write(AP_ADDR_CSW, AHB_AP_CSW_32BIT), TAG, "AP CSW setup failed");
    return ESP_OK;
}

static esp_err_t ahb_ap_read_idr(uint32_t *ap_idr)
{
    if (!ap_idr) {
        return ESP_ERR_INVALID_ARG;
    }
    ESP_RETURN_ON_ERROR(ahb_ap_select_bank(0xFU), TAG, "DP SELECT AP0 bankF failed");
    esp_err_t ret = ap_read(AP_ADDR_IDR, ap_idr);
    (void)ahb_ap_select_bank(0);
    return ret;
}

static esp_err_t ahb_read32(uint32_t addr, uint32_t *value)
{
    if (!value) {
        return ESP_ERR_INVALID_ARG;
    }
    ESP_RETURN_ON_ERROR(ahb_ap_setup(), TAG, "AHB-AP setup failed");
    ESP_RETURN_ON_ERROR(ap_write(AP_ADDR_TAR, addr), TAG, "AP TAR write 0x%08" PRIx32 " failed", addr);
    ESP_RETURN_ON_ERROR(ap_read(AP_ADDR_DRW, value), TAG, "AP DRW read 0x%08" PRIx32 " failed", addr);
    return ESP_OK;
}

static esp_err_t ahb_setup_csw(uint32_t csw)
{
    ESP_RETURN_ON_ERROR(ahb_ap_select_bank(0), TAG, "DP SELECT AP0 bank0 failed");
    ESP_RETURN_ON_ERROR(ap_write(AP_ADDR_CSW, csw), TAG, "AP CSW setup 0x%08" PRIx32 " failed", csw);
    return ESP_OK;
}

static esp_err_t ahb_write32_once(uint32_t addr, uint32_t value)
{
    ESP_RETURN_ON_ERROR(ahb_setup_csw(AHB_AP_CSW_32BIT), TAG, "AHB-AP 32-bit setup failed");
    ESP_RETURN_ON_ERROR(ap_write(AP_ADDR_TAR, addr), TAG, "AP TAR write 0x%08" PRIx32 " failed", addr);
    /* Give the MEM-AP time to accept the TAR write before the DRW write.
     * On the bench this is the first place that became flaky when going from
     * pure probe to real flash operations. */
    esp_rom_delay_us(50);
    ESP_RETURN_ON_ERROR(ap_write(AP_ADDR_DRW, value), TAG, "AP DRW write32 0x%08" PRIx32 " failed", addr);
    return ESP_OK;
}

static esp_err_t ahb_write32(uint32_t addr, uint32_t value)
{
    esp_err_t ret = ESP_FAIL;
    for (int attempt = 0; attempt < 3; ++attempt) {
        ret = ahb_write32_once(addr, value);
        if (ret == ESP_OK) {
            return ESP_OK;
        }
        ESP_LOGW(TAG,
                 "AHB write32 0x%08" PRIx32 " failed on attempt %d: %s; SWD resync + ABORT",
                 addr,
                 attempt + 1,
                 esp_err_to_name(ret));
        swd_protocol_recover();
        (void)dp_write(DP_ADDR_ABORT, DP_ABORT_ALL);
        esp_rom_delay_us(100);
    }
    return ret;
}

static esp_err_t ahb_write16(uint32_t addr, uint16_t value)
{
    ESP_RETURN_ON_ERROR(ahb_setup_csw(AHB_AP_CSW_16BIT), TAG, "AHB-AP 16-bit setup failed");
    ESP_RETURN_ON_ERROR(ap_write(AP_ADDR_TAR, addr), TAG, "AP TAR write 0x%08" PRIx32 " failed", addr);

    /* MEM-AP sub-word accesses use the address bits to select the byte lane,
     * but the data must also be placed into the matching DRW lane.
     *
     * For little-endian 16-bit writes:
     *   addr & 2 == 0 -> DRW[15:0]
     *   addr & 2 == 2 -> DRW[31:16]
     *
     * The previous fix wrote every halfword into DRW[15:0]. That programmed
     * the first halfword of each word but left the upper halfword erased/zero,
     * causing verify like: actual=0x00001000 expected=0x20001000 at 0x08000000.
     */
    uint32_t drw = (uint32_t)value << ((addr & 0x2U) ? 16U : 0U);
    ESP_RETURN_ON_ERROR(ap_write(AP_ADDR_DRW, drw), TAG, "AP DRW write16 0x%08" PRIx32 " failed", addr);
    return ESP_OK;
}

static inline uint32_t ahb_write16_drw_lane(uint32_t addr, uint16_t value)
{
    /* MEM-AP sub-word accesses still require WDATA in the selected DRW lane. */
    return (uint32_t)value << ((addr & 0x2U) ? 16U : 0U);
}

static esp_err_t ahb_write16_stream_begin(uint32_t addr)
{
    ESP_RETURN_ON_ERROR(ahb_setup_csw(AHB_AP_CSW_16BIT), TAG, "AHB-AP 16-bit stream setup failed");
    ESP_RETURN_ON_ERROR(ap_write(AP_ADDR_TAR, addr), TAG, "AP TAR stream write 0x%08" PRIx32 " failed", addr);
    esp_rom_delay_us(20);
    return ESP_OK;
}

static esp_err_t ahb_write16_stream_drw(uint32_t addr, uint16_t value)
{
    const uint32_t drw = ahb_write16_drw_lane(addr, value);
    ESP_RETURN_ON_ERROR(ap_write(AP_ADDR_DRW, drw), TAG, "AP DRW stream write16 0x%08" PRIx32 " failed", addr);
    return ESP_OK;
}

static esp_err_t ahb_read16_flash(uint32_t addr, uint16_t *value)
{
    if (!value) {
        return ESP_ERR_INVALID_ARG;
    }
    uint32_t word = 0;
    ESP_RETURN_ON_ERROR(ahb_read32(addr & ~0x3U, &word), TAG, "read16 backing word failed at 0x%08" PRIx32, addr);
    *value = (addr & 0x2U) ? (uint16_t)(word >> 16) : (uint16_t)(word & 0xFFFFU);
    return ESP_OK;
}

static esp_err_t swd_connect_after_reset_release(uint32_t *dp_idcode, const char *tag_reason)
{
    if (dp_idcode) {
        *dp_idcode = 0;
    }

