madmentat/mad-esp32p4_ass-pain_edition/main/stm32_swd_programmer.c
    ESP_LOGI(TAG, "%s: assert NRST, release, then immediately initialise DAP",
             tag_reason ? tag_reason : "SWD reset-release connect");

    nrst_assert();
    vTaskDelay(pdMS_TO_TICKS(30));

    /* Keep SWCLK/SWDIO already prepared, then release reset and start SWD
     * almost immediately. Some STM32F0 boards do not answer DP IDCODE while
     * NRST is physically held low, but the user firmware may later reconfigure
     * PA13/PA14. This sequence catches the debug port in the small safe window
     * right after reset release. */
    nrst_release();
    esp_rom_delay_us(700);

    uint32_t id = 0;
    esp_err_t ret = dap_init(&id);
    if (ret == ESP_OK && dp_idcode) {
        *dp_idcode = id;
    }
    return ret;
}

static esp_err_t swd_connect_and_power(uint32_t *dp_idcode)
{
    if (dp_idcode) {
        *dp_idcode = 0;
    }

    ESP_LOGI(TAG, "SWD connect: NRST released");
    nrst_release();
    vTaskDelay(pdMS_TO_TICKS(30));

    uint32_t id = 0;
    esp_err_t ret = dap_init(&id);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "SWD normal connect failed: %s; trying reset-release connect", esp_err_to_name(ret));
        ret = swd_connect_after_reset_release(&id, "SWD connect fallback");
    }

    if (ret == ESP_OK && dp_idcode) {
        *dp_idcode = id;
    }
    return ret;
}

static esp_err_t cortexm_halt(void)
{
    /* Enable halt. DEMCR vector-catch is best-effort insurance for reset/halt
     * flows; if it fails, plain DHCSR halt can still work. */
    (void)ahb_write32(ARM_DEMCR_ADDR, ARM_DEMCR_VC_CORERESET);
    ESP_RETURN_ON_ERROR(ahb_write32(ARM_DHCSR_ADDR, ARM_DHCSR_DBGKEY | ARM_DHCSR_C_DEBUGEN | ARM_DHCSR_C_HALT),
                        TAG, "DHCSR halt request failed");
    for (int i = 0; i < 100; ++i) {
        uint32_t dhcsr = 0;
        esp_err_t ret = ahb_read32(ARM_DHCSR_ADDR, &dhcsr);
        if (ret == ESP_OK && (dhcsr & ARM_DHCSR_S_HALT)) {
            ESP_LOGI(TAG, "Cortex-M halted: DHCSR=0x%08" PRIx32, dhcsr);
            return ESP_OK;
        }
        vTaskDelay(pdMS_TO_TICKS(2));
    }
    ESP_LOGW(TAG, "Cortex-M halt timeout; continuing anyway because flash interface may still be accessible");
    return ESP_OK;
}

static esp_err_t swd_full_recover_and_halt(const char *reason)
{
    ESP_LOGW(TAG, "%s: full SWD/DAP recover + halt", reason ? reason : "SWD recover");

    swd_protocol_recover();
    (void)dp_write(DP_ADDR_ABORT, DP_ABORT_ALL);
    vTaskDelay(pdMS_TO_TICKS(2));

    uint32_t id = 0;
    esp_err_t ret = dap_init(&id);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "%s: DAP re-init failed during recovery: %s",
                 reason ? reason : "SWD recover",
                 esp_err_to_name(ret));
        return ret;
    }

    ret = cortexm_halt();
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "%s: halt after recovery failed: %s",
                 reason ? reason : "SWD recover",
                 esp_err_to_name(ret));
    }
    return ret;
}

static esp_err_t stm32_flash_restore_program_mode(const char *reason)
{
    ESP_RETURN_ON_ERROR(swd_full_recover_and_halt(reason), TAG, "recover DAP/halt failed");

    uint32_t cr = 0;
    ESP_RETURN_ON_ERROR(ahb_read32(STM32F0_FLASH_CR, &cr), TAG, "FLASH_CR read during program recovery failed");
    if (cr & STM32F0_FLASH_CR_LOCK) {
        ESP_LOGW(TAG, "%s: FLASH_CR is locked after recovery; writing unlock keys again",
                 reason ? reason : "program recovery");
        ESP_RETURN_ON_ERROR(ahb_write32(STM32F0_FLASH_KEYR, STM32F0_FLASH_KEY1), TAG, "FLASH_KEY1 recovery write failed");
        ESP_RETURN_ON_ERROR(ahb_write32(STM32F0_FLASH_KEYR, STM32F0_FLASH_KEY2), TAG, "FLASH_KEY2 recovery write failed");
        ESP_RETURN_ON_ERROR(ahb_read32(STM32F0_FLASH_CR, &cr), TAG, "FLASH_CR reread after recovery unlock failed");
    }

    cr &= ~(STM32F0_FLASH_CR_PER | STM32F0_FLASH_CR_STRT);
    cr |= STM32F0_FLASH_CR_PG;
    ESP_RETURN_ON_ERROR(ahb_write32(STM32F0_FLASH_CR, cr), TAG, "FLASH_CR PG restore failed");
    vTaskDelay(1);
    return ESP_OK;
}

static esp_err_t swd_connect_under_reset_then_halt(uint32_t *dp_idcode)
{
    if (dp_idcode) {
        *dp_idcode = 0;
    }

    ESP_LOGI(TAG, "SWD flash reset-release connect: assert NRST, release, DAP init, halt immediately");

    uint32_t id = 0;
    esp_err_t ret = swd_connect_after_reset_release(&id, "SWD flash reset-release");
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "SWD reset-release DAP init failed: %s", esp_err_to_name(ret));
        nrst_release();
        vTaskDelay(pdMS_TO_TICKS(20));
        return ret;
    }

    ret = cortexm_halt();
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "Immediate halt after reset-release connect failed: %s", esp_err_to_name(ret));
        return ret;
    }

    if (dp_idcode) {
        *dp_idcode = id;
    }
    return ESP_OK;
}

static int stm32_flash_initial_wait_ms(const char *op)
{
    if (!op) {
        return 0;
    }

    /* Important bench finding:
     * Reading FLASH_SR immediately after setting STRT for a page erase can make
     * the AHB-AP transaction stall long enough that our software SWD stream loses
     * framing (ACK=0x05/0x07). Do not poll the flash controller while it is
     * certainly busy. Let the operation run for a conservative time, then read SR.
     */
    if (strstr(op, "page erase") != NULL) {
        return 45;        /* STM32F0 page erase is slow; 45 ms is safe on bench. */
    }
    if (strstr(op, "halfword program") != NULL) {
        return 0;         /* handled with sub-ms delay below */
    }
    return 0;
}

static int stm32_flash_initial_wait_us(const char *op)
{
    if (op && strstr(op, "halfword program") != NULL) {
        return 120;       /* avoid polling BSY immediately after each halfword. */
    }
    return 0;
}

static esp_err_t stm32_flash_wait_ready(const char *op, int timeout_ms)
{
    if (timeout_ms <= 0) {
        timeout_ms = 1000;
    }

    const int pre_ms = stm32_flash_initial_wait_ms(op);
    const int pre_us = stm32_flash_initial_wait_us(op);
    if (pre_ms > 0) {
        ESP_LOGI(TAG, "%s: blind wait %d ms before FLASH_SR polling", op ? op : "flash", pre_ms);
        vTaskDelay(pdMS_TO_TICKS(pre_ms));
        timeout_ms -= pre_ms;
        if (timeout_ms <= 0) {
            timeout_ms = 1;
        }
    } else if (pre_us > 0) {
        esp_rom_delay_us(pre_us);
    }

