madmentat/mad-esp32p4_ass-pain_edition/main/stm32_swd_programmer.c
    esp_err_t last = ESP_OK;
    for (int i = 0; i < timeout_ms; ++i) {
        uint32_t sr = 0;
        last = ahb_read32(STM32F0_FLASH_SR, &sr);
        if (last != ESP_OK) {
            ESP_LOGW(TAG,
                     "%s: FLASH_SR read failed while polling (%s), SWD resync and retry",
                     op ? op : "flash",
                     esp_err_to_name(last));
            swd_protocol_recover();
            (void)dp_write(DP_ADDR_ABORT, DP_ABORT_ALL);
            vTaskDelay(pdMS_TO_TICKS(2));
            continue;
        }
        if ((sr & STM32F0_FLASH_SR_BSY) == 0) {
            uint32_t clear = sr & (STM32F0_FLASH_SR_EOP | STM32F0_FLASH_SR_ERRS);
            if (clear) {
                (void)ahb_write32(STM32F0_FLASH_SR, clear);
            }
            if (sr & STM32F0_FLASH_SR_ERRS) {
                ESP_LOGE(TAG, "%s: FLASH_SR error=0x%08" PRIx32, op ? op : "flash", sr);
                return ESP_FAIL;
            }
            return ESP_OK;
        }
        vTaskDelay(pdMS_TO_TICKS(1));
    }
    ESP_LOGE(TAG, "%s: FLASH busy timeout / last=%s", op ? op : "flash", esp_err_to_name(last));
    return ESP_ERR_TIMEOUT;
}

static esp_err_t stm32_flash_unlock(void)
{
    uint32_t cr = 0;
    ESP_RETURN_ON_ERROR(ahb_read32(STM32F0_FLASH_CR, &cr), TAG, "FLASH_CR read failed");
    if ((cr & STM32F0_FLASH_CR_LOCK) == 0) {
        ESP_LOGI(TAG, "STM32 flash already unlocked: CR=0x%08" PRIx32, cr);
        return ESP_OK;
    }

    ESP_LOGI(TAG, "Unlocking STM32F0 flash");
    ESP_RETURN_ON_ERROR(ahb_write32(STM32F0_FLASH_KEYR, STM32F0_FLASH_KEY1), TAG, "FLASH_KEY1 write failed");
    ESP_RETURN_ON_ERROR(ahb_write32(STM32F0_FLASH_KEYR, STM32F0_FLASH_KEY2), TAG, "FLASH_KEY2 write failed");
    ESP_RETURN_ON_ERROR(ahb_read32(STM32F0_FLASH_CR, &cr), TAG, "FLASH_CR verify read failed");
    if (cr & STM32F0_FLASH_CR_LOCK) {
        ESP_LOGE(TAG, "STM32 flash unlock failed: CR=0x%08" PRIx32, cr);
        return ESP_ERR_INVALID_STATE;
    }
    return ESP_OK;
}

static esp_err_t stm32_flash_erase_page(uint32_t page_addr)
{
    ESP_RETURN_ON_ERROR(stm32_flash_wait_ready("before page erase", 1000), TAG, "flash not ready before erase");

    uint32_t cr = 0;
    ESP_RETURN_ON_ERROR(ahb_read32(STM32F0_FLASH_CR, &cr), TAG, "FLASH_CR read before erase failed");
    cr &= ~(STM32F0_FLASH_CR_PG | STM32F0_FLASH_CR_PER | STM32F0_FLASH_CR_STRT);
    ESP_RETURN_ON_ERROR(ahb_write32(STM32F0_FLASH_CR, cr | STM32F0_FLASH_CR_PER), TAG, "FLASH_CR PER set failed");
    ESP_RETURN_ON_ERROR(ahb_write32(STM32F0_FLASH_AR, page_addr), TAG, "FLASH_AR page addr failed");
    ESP_RETURN_ON_ERROR(ahb_write32(STM32F0_FLASH_CR, cr | STM32F0_FLASH_CR_PER | STM32F0_FLASH_CR_STRT), TAG, "FLASH_CR STRT failed");
    esp_err_t ret = stm32_flash_wait_ready("page erase", 1500);
    (void)ahb_write32(STM32F0_FLASH_CR, cr & ~STM32F0_FLASH_CR_PER);
    return ret;
}

static esp_err_t stm32_flash_program_wait_settle(const char *op, uint32_t addr, uint32_t off)
{
    /* Do not poll FLASH_SR after every halfword. On this bench STM32F0 can stall
     * the AHB-AP while flash is busy, and a software SWD master then tends to
     * lose framing. A conservative blind delay is slower but much more stable. */
    esp_rom_delay_us(STM32F0_PROG_BLIND_DELAY_US);

#if STM32F0_PROG_SR_CHECK_BYTES > 0
    if (((off + 2U) % STM32F0_PROG_SR_CHECK_BYTES) == 0U) {
        vTaskDelay(1);
        uint32_t sr = 0;
        esp_err_t ret = ahb_read32(STM32F0_FLASH_SR, &sr);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG,
                     "%s: deferred FLASH_SR read failed after +0x%04" PRIx32 " addr=0x%08" PRIx32 " (%s); resync and continue cautiously",
                     op ? op : "program",
                     off,
                     addr,
                     esp_err_to_name(ret));
            swd_protocol_recover();
            (void)dp_write(DP_ADDR_ABORT, DP_ABORT_ALL);
            vTaskDelay(pdMS_TO_TICKS(2));
            return ESP_OK;
        }

        if (sr & STM32F0_FLASH_SR_ERRS) {
            ESP_LOGE(TAG,
                     "%s: FLASH_SR error after +0x%04" PRIx32 ": SR=0x%08" PRIx32,
                     op ? op : "program",
                     off,
                     sr);
            return ESP_FAIL;
        }

        if (sr & STM32F0_FLASH_SR_EOP) {
            (void)ahb_write32(STM32F0_FLASH_SR, STM32F0_FLASH_SR_EOP);
        }
    } else
#endif
    if (((off / 2U) % STM32F0_PROG_YIELD_EVERY_HW) == 0U) {
        /* Let IDLE0 run. Otherwise the software SWD tight loop trips the task
         * watchdog while the flash operation itself is still progressing OK. */
        vTaskDelay(1);
    }

    return ESP_OK;
}

static esp_err_t stm32_flash_program_halfwords(uint32_t flash_base, const uint8_t *image, size_t image_size)
{
    uint32_t cr = 0;
    ESP_RETURN_ON_ERROR(ahb_read32(STM32F0_FLASH_CR, &cr), TAG, "FLASH_CR read before program failed");
    cr &= ~(STM32F0_FLASH_CR_PER | STM32F0_FLASH_CR_STRT);
    ESP_RETURN_ON_ERROR(ahb_write32(STM32F0_FLASH_CR, cr | STM32F0_FLASH_CR_PG), TAG, "FLASH_CR PG set failed");

    ESP_LOGI(TAG,
             "STM32 flash program: streamed MEM-AP 16-bit DRW, chunk=%u bytes, blind delay %u us/halfword, yield every %u halfwords, SR check %s",
             (unsigned)STM32F0_PROG_STREAM_CHUNK_BYTES,
             (unsigned)STM32F0_PROG_BLIND_DELAY_US,
             (unsigned)STM32F0_PROG_YIELD_EVERY_HW,
#if STM32F0_PROG_SR_CHECK_BYTES > 0
             "periodic"
#else
             "disabled during program"
#endif
             );

    bool stream_open = false;

    for (size_t off = 0; off < image_size; off += 2) {
        const uint32_t addr = flash_base + (uint32_t)off;
        uint16_t hw = image[off];
        if (off + 1 < image_size) {
            hw |= (uint16_t)image[off + 1] << 8;
        } else {
            hw |= 0xFF00U;
        }

        if (!stream_open || ((off % STM32F0_PROG_STREAM_CHUNK_BYTES) == 0U)) {
            esp_err_t ret = ahb_write16_stream_begin(addr);
            if (ret != ESP_OK) {
                ESP_LOGW(TAG,
                         "program stream begin failed at +0x%04x (%s); full recovery",
                         (unsigned)off,
                         esp_err_to_name(ret));
                ESP_RETURN_ON_ERROR(stm32_flash_restore_program_mode("program stream begin"), TAG, "program stream recovery failed");
                ESP_RETURN_ON_ERROR(ahb_write16_stream_begin(addr), TAG, "program stream restart failed at +0x%zx", off);
            }
            stream_open = true;
        }

        esp_err_t ret = ESP_FAIL;
        for (int attempt = 0; attempt < STM32F0_PROG_RETRY_COUNT; ++attempt) {
            ret = ahb_write16_stream_drw(addr, hw);
            if (ret == ESP_OK) {
                break;
            }

            ESP_LOGW(TAG,
                     "flash stream write16 failed at +0x%04x addr=0x%08" PRIx32 " attempt=%d/%d: %s",
                     (unsigned)off,
                     addr,
                     attempt + 1,
                     STM32F0_PROG_RETRY_COUNT,
                     esp_err_to_name(ret));

            esp_err_t rec = stm32_flash_restore_program_mode("flash stream write16");
            if (rec != ESP_OK) {
                ret = rec;
                continue;
            }

            uint16_t actual = 0xFFFFU;
            if (ahb_read16_flash(addr, &actual) == ESP_OK) {
                if (actual == hw) {
                    ESP_LOGW(TAG, "halfword at +0x%04x was already programmed OK after recovery", (unsigned)off);
                    ret = ESP_OK;
                    break;
                }
                if ((actual & hw) != hw) {
                    ESP_LOGE(TAG,
                             "halfword at +0x%04x is not recoverable: actual=0x%04x expected=0x%04x",
                             (unsigned)off,
                             actual,
                             hw);
                    return ESP_ERR_INVALID_CRC;
                }
            }

