madmentat/mad-esp32p4_ass-pain_edition/main/stm32_swd_programmer.c
            ESP_RETURN_ON_ERROR(ahb_write16_stream_begin(addr), TAG, "program stream restart failed at +0x%zx", off);
            stream_open = true;
        }

        ESP_RETURN_ON_ERROR(ret, TAG, "flash write16 failed at +0x%zx", off);
        ESP_RETURN_ON_ERROR(stm32_flash_program_wait_settle("halfword program", addr, (uint32_t)off),
                            TAG,
                            "flash settle failed at +0x%zx",
                            off);

        if ((off & 0x3FFU) == 0) {
            ESP_LOGI(TAG, "STM32 flash program progress: %u/%u bytes", (unsigned)off, (unsigned)image_size);
        }
    }

    vTaskDelay(pdMS_TO_TICKS(20));
    uint32_t sr = 0;
    ESP_RETURN_ON_ERROR(ahb_read32(STM32F0_FLASH_SR, &sr), TAG, "FLASH_SR final read after program failed");
    if (sr & STM32F0_FLASH_SR_ERRS) {
        ESP_LOGE(TAG, "FLASH_SR final program error: SR=0x%08" PRIx32, sr);
        return ESP_FAIL;
    }
    if (sr & STM32F0_FLASH_SR_EOP) {
        (void)ahb_write32(STM32F0_FLASH_SR, STM32F0_FLASH_SR_EOP);
    }

    ESP_RETURN_ON_ERROR(ahb_read32(STM32F0_FLASH_CR, &cr), TAG, "FLASH_CR read after program failed");
    (void)ahb_write32(STM32F0_FLASH_CR, cr & ~STM32F0_FLASH_CR_PG);
    return ESP_OK;
}

static esp_err_t stm32_flash_verify(uint32_t flash_base, const uint8_t *image, size_t image_size)
{
    for (size_t off = 0; off < image_size; off += 4) {
        uint32_t expected = 0xFFFFFFFFU;
        uint32_t bytes = 0;
        for (unsigned i = 0; i < 4 && off + i < image_size; ++i) {
            bytes |= (uint32_t)image[off + i] << (8U * i);
        }
        if (image_size - off >= 4) {
            expected = bytes;
        } else {
            uint32_t mask = (1U << ((image_size - off) * 8U)) - 1U;
            expected = (0xFFFFFFFFU & ~mask) | bytes;
        }

        uint32_t actual = 0;
        ESP_RETURN_ON_ERROR(ahb_read32(flash_base + (uint32_t)off, &actual), TAG, "verify read failed at +0x%zx", off);
        if (actual != expected) {
            ESP_LOGE(TAG, "verify mismatch at 0x%08" PRIx32 ": actual=0x%08" PRIx32 " expected=0x%08" PRIx32,
                     flash_base + (uint32_t)off,
                     actual,
                     expected);
            return ESP_ERR_INVALID_CRC;
        }
        if ((off & 0x3FFU) == 0U) {
            vTaskDelay(1);
        }
    }
    ESP_LOGI(TAG, "STM32 flash verify OK: %u bytes", (unsigned)image_size);
    return ESP_OK;
}

static void cortexm_prepare_run_after_debug(void)
{
    /* We halted the core and enabled vector-catch while programming. If those
     * bits are left set, a physical NRST pulse can look like a failed reboot:
     * the MCU resets but immediately stops in the debugger. Clear vector-catch
     * and release C_HALT before the final reset. */
    esp_err_t ret = ahb_write32(ARM_DEMCR_ADDR, 0);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "DEMCR clear before run failed/non-fatal: %s", esp_err_to_name(ret));
    }

    ret = ahb_write32(ARM_DHCSR_ADDR, ARM_DHCSR_DBGKEY | ARM_DHCSR_C_DEBUGEN);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "DHCSR run request before reset failed/non-fatal: %s", esp_err_to_name(ret));
    }

    /* Same reset mechanism as CMSIS __NVIC_SystemReset(): VECTKEY + SYSRESETREQ.
     * The following NRST pulse is still kept as a hardware-level fallback. */
    ret = ahb_write32(ARM_AIRCR_ADDR, ARM_AIRCR_VECTKEY | ARM_AIRCR_SYSRESETREQ);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "AIRCR SYSRESETREQ failed/non-fatal: %s", esp_err_to_name(ret));
    } else {
        vTaskDelay(pdMS_TO_TICKS(20));
    }
}

static void stm32_target_reset_run(bool swd_may_be_alive)
{
    ESP_LOGI(TAG, "Resetting STM32 target after SWD operation%s",
             swd_may_be_alive ? " and releasing debug halt" : " using hardware NRST only");
    if (swd_may_be_alive) {
        cortexm_prepare_run_after_debug();
    }
    nrst_assert();
    vTaskDelay(pdMS_TO_TICKS(20));
    nrst_release();
    vTaskDelay(pdMS_TO_TICKS(80));
    swd_bus_release_idle();
}

esp_err_t stm32_swd_programmer_flash_image(const uint8_t *image, size_t image_size, uint32_t flash_base)
{
#if !CONFIG_STM32_SWD_ENABLE
    return ESP_ERR_NOT_SUPPORTED;
#else
    if (!image || image_size == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    if (s_probe_task) {
        ESP_LOGW(TAG, "SWD probe task is already running; cannot start STM32 flash");
        return ESP_ERR_INVALID_STATE;
    }
    if (image_size > STM32F0_FLASH_MAX_BYTES) {
        ESP_LOGE(TAG, "STM32 image too large for STM32F030K6T6 flash: %u > %u", (unsigned)image_size, (unsigned)STM32F0_FLASH_MAX_BYTES);
        return ESP_ERR_INVALID_SIZE;
    }
    if (flash_base < STM32F0_FLASH_BASE_ADDR || flash_base + image_size > STM32F0_FLASH_BASE_ADDR + STM32F0_FLASH_MAX_BYTES) {
        ESP_LOGE(TAG, "STM32 flash range invalid: base=0x%08" PRIx32 " size=%u", flash_base, (unsigned)image_size);
        return ESP_ERR_INVALID_ARG;
    }

    if (s_swd_lock && xSemaphoreTake(s_swd_lock, pdMS_TO_TICKS(1000)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }

    s_swd_delay_us = SWD_DELAY_US_DEFAULT;
    swd_bus_prepare();

    esp_err_t ret = ESP_OK;
    int64_t t0 = esp_timer_get_time();
    uint32_t dp_idcode = 0;
    uint32_t cpuid = 0;
    uint32_t page_count = (uint32_t)((image_size + STM32F0_FLASH_PAGE_SIZE - 1U) / STM32F0_FLASH_PAGE_SIZE);
    bool swd_connected = false;

    state_set(STM32_SWD_STATUS_BUSY, ESP_OK, "STM32 OTA flashing");
    state_set_values(0, 0, 0);

    ESP_LOGW(TAG, "STM32 flash image start: base=0x%08" PRIx32 " size=%u pages=%u bit_delay=%dus",
             flash_base,
             (unsigned)image_size,
             (unsigned)page_count,
             (int)s_swd_delay_us);

    ESP_LOGI(TAG, "STM32 flash: normal SWD connect + halt-first");
    ret = swd_connect_and_power(&dp_idcode);
    if (ret == ESP_OK) {
        ret = cortexm_halt();
    }
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "STM32 flash: normal connect/halt failed: %s; trying connect-under-reset", esp_err_to_name(ret));
        ret = swd_connect_under_reset_then_halt(&dp_idcode);
    }
    if (ret != ESP_OK && s_swd_delay_us < SWD_DELAY_US_SLOW) {
        ESP_LOGW(TAG, "STM32 flash: connect failed at %u us delay; retrying once with slow %u us delay",
                 (unsigned)s_swd_delay_us,
                 (unsigned)SWD_DELAY_US_SLOW);
        s_swd_delay_us = SWD_DELAY_US_SLOW;
        swd_bus_prepare();
        ret = swd_connect_under_reset_then_halt(&dp_idcode);
    }
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "STM32 flash: SWD connect/halt failed: %s", esp_err_to_name(ret));
        goto done;
    }
    swd_connected = true;

    ret = ahb_read32(ARM_CPUID_ADDR, &cpuid);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "STM32 flash: CPUID read after halt failed: %s", esp_err_to_name(ret));
        goto done;
    }
    ESP_LOGI(TAG, "STM32 flash: DP_IDCODE=0x%08" PRIx32 " CPUID=0x%08" PRIx32 " halted=1", dp_idcode, cpuid);

    ESP_GOTO_ON_ERROR(stm32_flash_unlock(), done, TAG, "STM32 flash unlock failed");
    ESP_GOTO_ON_ERROR(stm32_flash_wait_ready("before full erase/program", 1000), done, TAG, "flash not ready");

