madmentat/mad-esp32p4_ass-pain_edition/main/stm32_swd_programmer.c
    for (uint32_t page = 0; page < page_count; ++page) {
        uint32_t page_addr = flash_base + page * STM32F0_FLASH_PAGE_SIZE;
        ESP_LOGI(TAG, "STM32 flash erase page %u/%u at 0x%08" PRIx32, (unsigned)(page + 1), (unsigned)page_count, page_addr);
        ESP_GOTO_ON_ERROR(stm32_flash_erase_page(page_addr), done, TAG, "erase page failed");
    }

    ESP_GOTO_ON_ERROR(stm32_flash_program_halfwords(flash_base, image, image_size), done, TAG, "program failed");
    ESP_GOTO_ON_ERROR(stm32_flash_verify(flash_base, image, image_size), done, TAG, "verify failed");

    state_set_values(dp_idcode, cpuid, 0);
    state_set(STM32_SWD_STATUS_OK, ESP_OK, "STM32 flash OK");
    ESP_LOGW(TAG, "STM32 flash image OK in %lld ms", (long long)((esp_timer_get_time() - t0) / 1000));

done:
    if (ret != ESP_OK) {
        state_set_values(dp_idcode, cpuid, 0);
        state_set(STM32_SWD_STATUS_FAILED, ret, "STM32 flash failed");
        ESP_LOGE(TAG, "STM32 flash image failed: %s", esp_err_to_name(ret));
    }
    stm32_target_reset_run(swd_connected);
    s_swd_delay_us = SWD_DELAY_US_DEFAULT;
    if (s_swd_lock) {
        xSemaphoreGive(s_swd_lock);
    }
    return ret;
#endif
}

esp_err_t stm32_swd_programmer_init(void)
{
#if !CONFIG_STM32_SWD_ENABLE
    state_set(STM32_SWD_STATUS_IDLE, ESP_ERR_NOT_SUPPORTED, "SWD disabled");
    return ESP_ERR_NOT_SUPPORTED;
#else
    if (!s_swd_lock) {
        s_swd_lock = xSemaphoreCreateMutex();
        if (!s_swd_lock) {
            state_set(STM32_SWD_STATUS_FAILED, ESP_ERR_NO_MEM, "SWD mutex create failed");
            return ESP_ERR_NO_MEM;
        }
    }

    gpio_config_t cfg = {
        .pin_bit_mask = (1ULL << SWD_PIN_NRST) | (1ULL << SWD_PIN_SWCLK) | (1ULL << SWD_PIN_SWDIO),
        .mode = GPIO_MODE_DISABLE,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    ESP_RETURN_ON_ERROR(gpio_config(&cfg), TAG, "gpio_config reset failed");

    ESP_RETURN_ON_ERROR(gpio_set_pull_mode(SWD_PIN_NRST, GPIO_PULLUP_ONLY), TAG, "NRST pull-up failed");
    ESP_RETURN_ON_ERROR(gpio_set_pull_mode(SWD_PIN_SWDIO, GPIO_PULLUP_ONLY), TAG, "SWDIO pull-up failed");
    swd_bus_prepare();

    ESP_LOGI(TAG,
             "STM32 SWD programmer GPIO init: CMSIS-style SWD_Transfer fix25 ack5-no-extra-turnaround reset-release, NRST=%d(open-drain style, PU) SWDIO=%d(PU) SWCLK=%d bit_delay=%dus turnaround=%u idle=%u task_prio=%d core=%d",
             (int)SWD_PIN_NRST,
             (int)SWD_PIN_SWDIO,
             (int)SWD_PIN_SWCLK,
             (int)s_swd_delay_us,
             SWD_TURNAROUND_CYCLES,
             SWD_IDLE_CYCLES,
             CONFIG_STM32_SWD_TASK_PRIORITY,
             CONFIG_STM32_SWD_TASK_CORE);

    state_set(STM32_SWD_STATUS_IDLE, ESP_OK, "ready");
    return ESP_OK;
#endif
}

esp_err_t stm32_swd_programmer_probe(void)
{
#if !CONFIG_STM32_SWD_ENABLE
    return ESP_ERR_NOT_SUPPORTED;
#else
    if (s_swd_lock && xSemaphoreTake(s_swd_lock, pdMS_TO_TICKS(1000)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }

    s_swd_delay_us = SWD_DELAY_US_DEFAULT;
    swd_bus_prepare();

    uint32_t dp_idcode = 0;
    uint32_t ap_idr = 0;
    uint32_t cpuid = 0;
    uint32_t dbgmcu_idcode = 0;
    int64_t t0 = esp_timer_get_time();

    state_set(STM32_SWD_STATUS_BUSY, ESP_OK, "probing");
    state_set_values(0, 0, 0);

    ESP_LOGI(TAG, "SWD probe start (CMSIS-style transfer core)");

    swd_scope_pin_test();

    ESP_LOGI(TAG, "SWD normal probe: NRST released");
    nrst_release();
    vTaskDelay(pdMS_TO_TICKS(30));

    esp_err_t ret = dap_init(&dp_idcode);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "SWD normal probe failed: %s; trying reset-release probe", esp_err_to_name(ret));

        dp_idcode = 0;
        ret = swd_connect_after_reset_release(&dp_idcode, "SWD probe reset-release");
    }
    if (ret != ESP_OK && s_swd_delay_us < SWD_DELAY_US_SLOW) {
        ESP_LOGW(TAG, "SWD probe failed at %u us delay; retrying once with slow %u us delay",
                 (unsigned)s_swd_delay_us,
                 (unsigned)SWD_DELAY_US_SLOW);
        s_swd_delay_us = SWD_DELAY_US_SLOW;
        swd_bus_prepare();
        dp_idcode = 0;
        ret = swd_connect_after_reset_release(&dp_idcode, "SWD probe slow reset-release");
    }

    if (ret != ESP_OK) {
        nrst_release();
        state_set_values(dp_idcode, 0, 0);
        state_set(STM32_SWD_STATUS_FAILED, ret, "DP probe failed");
        ESP_LOGE(TAG, "SWD probe failed at DP init: %s", esp_err_to_name(ret));
        swd_bus_release_idle();
        s_swd_delay_us = SWD_DELAY_US_DEFAULT;
        if (s_swd_lock) {
            xSemaphoreGive(s_swd_lock);
        }
        return ret;
    }

    ret = ahb_ap_read_idr(&ap_idr);
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "AHB-AP IDR: 0x%08" PRIx32, ap_idr);
    } else {
        ESP_LOGW(TAG, "AHB-AP IDR read failed/non-fatal for now: %s", esp_err_to_name(ret));
    }

    ret = ahb_read32(ARM_CPUID_ADDR, &cpuid);
    if (ret != ESP_OK) {
        state_set_values(dp_idcode, 0, 0);
        state_set(STM32_SWD_STATUS_FAILED, ret, "CPUID read failed");
        ESP_LOGE(TAG, "SWD probe failed at CPUID read: %s", esp_err_to_name(ret));
        swd_bus_release_idle();
        s_swd_delay_us = SWD_DELAY_US_DEFAULT;
        if (s_swd_lock) {
            xSemaphoreGive(s_swd_lock);
        }
        return ret;
    }

    ret = ahb_read32(STM32F0_DBGMCU_IDCODE_ADDR, &dbgmcu_idcode);
    if (ret != ESP_OK) {
        ESP_LOGW(TAG, "DBGMCU_IDCODE read failed/non-fatal: %s", esp_err_to_name(ret));
        dbgmcu_idcode = 0;
        ret = ESP_OK;
    }

    state_set_values(dp_idcode, cpuid, dbgmcu_idcode);
    state_set(STM32_SWD_STATUS_OK, ESP_OK, "probe OK");

    int64_t t1 = esp_timer_get_time();
    ESP_LOGI(TAG,
             "SWD probe OK in %lld ms: DP_IDCODE=0x%08" PRIx32 " AP_IDR=0x%08" PRIx32 " CPUID=0x%08" PRIx32 " STM32F0_DBGMCU_IDCODE=0x%08" PRIx32,
             (long long)((t1 - t0) / 1000),
             dp_idcode,
             ap_idr,
             cpuid,
             dbgmcu_idcode);

    swd_bus_release_idle();
    s_swd_delay_us = SWD_DELAY_US_DEFAULT;
    if (s_swd_lock) {
        xSemaphoreGive(s_swd_lock);
    }
    return ESP_OK;
#endif
}

static void swd_probe_task(void *arg)
{
    (void)arg;
    stm32_swd_programmer_probe();
    s_probe_task = NULL;
    vTaskDelete(NULL);
}

