madmentat/mad-esp32p4_ass-pain_edition/main/stm32_swd_programmer.c
esp_err_t stm32_swd_programmer_probe_async(void)
{
#if !CONFIG_STM32_SWD_ENABLE
    return ESP_ERR_NOT_SUPPORTED;
#else
    if (s_probe_task) {
        return ESP_ERR_INVALID_STATE;
    }

    BaseType_t ok = xTaskCreatePinnedToCore(swd_probe_task,
                                            "stm32_swd_probe",
                                            CONFIG_STM32_SWD_TASK_STACK_SIZE,
                                            NULL,
                                            CONFIG_STM32_SWD_TASK_PRIORITY,
                                            &s_probe_task,
                                            CONFIG_STM32_SWD_TASK_CORE);
    if (ok != pdPASS) {
        s_probe_task = NULL;
        state_set(STM32_SWD_STATUS_FAILED, ESP_ERR_NO_MEM, "probe task create failed");
        return ESP_ERR_NO_MEM;
    }

    return ESP_OK;
#endif
}

stm32_swd_status_t stm32_swd_programmer_get_status(void)
{
    stm32_swd_status_t status;
    portENTER_CRITICAL(&s_state_mux);
    status = s_state.status;
    portEXIT_CRITICAL(&s_state_mux);
    return status;
}

const stm32_swd_state_t *stm32_swd_programmer_get_state(void)
{
    return &s_state;
}

const char *stm32_swd_programmer_get_status_text(void)
{
    switch (stm32_swd_programmer_get_status()) {
    case STM32_SWD_STATUS_IDLE:
        return "SWD IDLE";
    case STM32_SWD_STATUS_BUSY:
        return "SWD BUSY";
    case STM32_SWD_STATUS_OK:
        return "SWD OK";
    case STM32_SWD_STATUS_FAILED:
        return "SWD FAIL";
    default:
        return "SWD ?";
    }
}
